; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj3 - airport
	obj1 obj4 - city
	obj2 obj5 obj9 obj10 obj11 obj12 obj13 obj14 obj15 obj16 - package
	obj6 obj7 - truck
	obj8 - airplane
)

(:init
	(at obj12 obj0)
	(at obj7 obj0)
	(in-city obj0 obj1)
	(at obj14 obj3)
	(at obj9 obj3)
	(at obj2 obj0)
	(in-city obj3 obj4)
	(at obj6 obj3)
	(at obj5 obj3)
	(at obj10 obj0)
	(at obj8 obj3)
	(at obj13 obj0)
	(at obj11 obj3)
	(at obj16 obj0)
	(at obj15 obj3)
)

(:goal (and
	(at obj11 obj0)
	(at obj2 obj3)
	(at obj16 obj3)
	(at obj12 obj3)
	(at obj15 obj0)
	(at obj13 obj3)
	(at obj14 obj0)
	(at obj9 obj0)
	(at obj5 obj0)
))
)

; plan
1. (load obj8 obj9 obj3)
   deleted: (at obj9 obj3)
   added: (in obj9 obj8)
   goals met: 0 of 9
2. (load obj8 obj5 obj3)
   deleted: (at obj5 obj3)
   added: (in obj5 obj8)
   goals met: 0 of 9
3. (load obj8 obj15 obj3)
   deleted: (at obj15 obj3)
   added: (in obj15 obj8)
   goals met: 0 of 9
4. (load obj8 obj14 obj3)
   deleted: (at obj14 obj3)
   added: (in obj14 obj8)
   goals met: 0 of 9
5. (load obj8 obj11 obj3)
   deleted: (at obj11 obj3)
   added: (in obj11 obj8)
   goals met: 0 of 9
6. (fly obj8 obj3 obj0)
   deleted: (at obj8 obj3)
   added: (at obj8 obj0)
   goals met: 0 of 9
7. (unload obj8 obj9 obj0)
   deleted: (in obj9 obj8)
   added: (at obj9 obj0)
   goals met: 1 of 9
8. (unload obj8 obj5 obj0)
   deleted: (in obj5 obj8)
   added: (at obj5 obj0)
   goals met: 2 of 9
9. (load obj8 obj2 obj0)
   deleted: (at obj2 obj0)
   added: (in obj2 obj8)
   goals met: 2 of 9
10. (load obj8 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj8)
   goals met: 2 of 9
11. (unload obj8 obj15 obj0)
   deleted: (in obj15 obj8)
   added: (at obj15 obj0)
   goals met: 3 of 9
12. (unload obj8 obj14 obj0)
   deleted: (in obj14 obj8)
   added: (at obj14 obj0)
   goals met: 4 of 9
13. (load obj8 obj13 obj0)
   deleted: (at obj13 obj0)
   added: (in obj13 obj8)
   goals met: 4 of 9
14. (load obj8 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj8)
   goals met: 4 of 9
15. (unload obj8 obj11 obj0)
   deleted: (in obj11 obj8)
   added: (at obj11 obj0)
   goals met: 5 of 9
16. (fly obj8 obj0 obj3)
   deleted: (at obj8 obj0)
   added: (at obj8 obj3)
   goals met: 5 of 9
17. (unload obj8 obj2 obj3)
   deleted: (in obj2 obj8)
   added: (at obj2 obj3)
   goals met: 6 of 9
18. (unload obj8 obj16 obj3)
   deleted: (in obj16 obj8)
   added: (at obj16 obj3)
   goals met: 7 of 9
19. (unload obj8 obj13 obj3)
   deleted: (in obj13 obj8)
   added: (at obj13 obj3)
   goals met: 8 of 9
20. (unload obj8 obj12 obj3)
   deleted: (in obj12 obj8)
   added: (at obj12 obj3)
   goals met: 9 of 9
